# Sarah Quesnelle, 53914140

### Question 1:

- **Has there been a significant change in average Temperature for BC, Canada between the years of 1917 to 2017?**

### Question 2:

- **Q2: Which Season has seen the greatest change in Temperature over the given years? Winter(January) or Summer(August)**

### Question 3:

- **Has there been a significant change in the amount of snowfall in Canada since 1917?**

In [4]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import seaborn as sns
import math
import sys
import os
sys.path.append('./code/')
import Project_Functions as ProFun
import glob

### Test Data Cleaning function from Project Functions

In [2]:
testpath = "../data/raw/Canada/csv_canada_1917_1.CSV"
testdf = ProFun.DataClean(testpath)
testdf.head()

   Year  Month                   Stn_Name Prov   Tm     S      P
0  1917      1                   COWICHAN   BC  1.3  54.6  114.7
1  1917      1  COWICHAN BAY CHERRY POINT   BC  1.3  24.1   87.7
2  1917      1               JAMES ISLAND   BC  3.3  25.3   95.8
3  1917      1                  METCHOSIN   BC  2.2  46.9  156.4
4  1917      1             MILNES LANDING   BC  2.4  16.5  127.8

In [6]:
path = "../data/raw/Canada/"
csv_files = glob.glob(os.path.join(path, "*.CSV"))
tempdata = ProFun.DataCombine(csv_files)

In [7]:
save_path = "../data/processed/Canada/Canada_Temperature_data.csv"
tempdata.to_csv(save_path, index=False)

In [4]:
test.head()

   Year  Month                   Stn_Name Prov   Tm     S      P
0  1917      1                   COWICHAN   BC  1.3  54.6  114.7
1  1917      1  COWICHAN BAY CHERRY POINT   BC  1.3  24.1   87.7
2  1917      1               JAMES ISLAND   BC  3.3  25.3   95.8
3  1917      1                  METCHOSIN   BC  2.2  46.9  156.4
4  1917      1             MILNES LANDING   BC  2.4  16.5  127.8

In [6]:
test['Month'].unique()

array([ 1, 12], dtype=int8)

In [7]:
test['Year'].unique()

array([1917], dtype=int16)

In [8]:
test.describe(include=np.number)

         Year      Month          Tm           S           P
count   744.0  744.00000  744.000000  744.000000  744.000000
mean   1917.0    6.52957  -12.587903   47.048522   76.544892
std       0.0    5.50362    8.544665   40.931252   81.074085
min    1917.0    1.00000  -46.300000    0.000000    0.000000
25%    1917.0    1.00000  -19.150000   20.200000   27.150000
50%    1917.0   12.00000  -12.750000   38.200000   55.300000
75%    1917.0   12.00000   -6.600000   62.125000   92.075000
max    1917.0   12.00000    5.500000  474.700000  539.300000

In [9]:
test.describe(exclude=np.number)

         Stn_Name Prov
count         744  744
unique        406   12
top     WOODSTOCK   BC
freq            3  190